DataProcessors/ПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПлатежныйКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДнейПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланироватьСДаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодовДолгосрочногоПланирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДолгосрочногоПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПланированияПоДням</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДолгосрочногоПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВыходные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеревоПлатежей</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесогласованныеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказыКлиентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказыПоставщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратыКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратыОтПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаИтогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоВалютам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборОрганизации</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборБанковскиеСчетаКассы</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНераспределенныеПоСчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрСчетовКалендаря</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилищаМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитыИлиЗаймыПолученные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаймыВыданные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аренда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемыеПоступления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаДереваПлатежей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевыеОстаткиИОбороты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппировкиОтчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикОтбор</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаОтображенияПросроченныхПлатежей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьДокументыПриСоздании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ГрафикПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикПлатежей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиПланированияПлатежей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиГрафика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПретензийКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаВозвратТоваровОтКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыТаможенныхДеклараций</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровКонтрагентов</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовПоставщикам</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокСотрудников</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыРеализацийТоваровУслуг</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыАктовПремийКлиентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заморожен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйБанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходнаяДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлательщикПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСуммГрафикаКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоступлениеСписание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПлатежныйКалендарь/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет дерево платежей
//
// Параметры:
//    ПараметрыРасчета - Структура - Параметры для расчета, см. ПараметрыРасчетаКалендаря модуля формы.
//
Процедура РассчитатьДанныеКалендаря(ПараметрыРасчета) Экспорт
	
	Если ФильтрСчетовКалендаря = 2 Тогда
		Заявка = Неопределено;
		Если ПараметрыРасчета.Свойство("Заявка", Заявка) Тогда
			Если ЗначениеЗаполнено(Заявка) Тогда
				Платежи = Новый СписокЗначений;
				Платежи.Добавить(Заявка);
				БанковскиеСчетаКассыЗаявки = Обработки.ПлатежныйКалендарь.БанковскиеСчетаКассыДоступныеДляОбъектаОплаты(
					Платежи, Истина);
				ОтборБанковскиеСчетаКассы.ЗагрузитьЗначения(БанковскиеСчетаКассыЗаявки);
				ОтборБанковскиеСчетаКассы.ЗаполнитьПометки(Истина);
				
				УстановитьКомпоновщикОтборПоОтборБанковскиеСчетаКассы(КомпоновщикОтбор, ОтборБанковскиеСчетаКассы);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СКД = ПолучитьМакет("ДеревоПлатежей");
	ВариантНастроек = СКД.НастройкиПоУмолчанию;
	
	ДополнитьКолонкиДней(СКД, ВариантНастроек);
	ДополнитьКолонкиДолгосрочногоПланирования(СКД, ВариантНастроек);
	
	// Настройка ресурса "Группировка"
	
	РесурсГруппировка = СКД.ПоляИтога.Найти("Группировка");
	
	ВыражениеБанкКассы = "КОГДА ВычислитьВыражение(1, ""БанкКассы"") = 1 ТОГДА БанкКассы";
	ВыражениеТипДС = "КОГДА ВычислитьВыражение(1, ""ТипДенежныхСредств"") = 1 ТОГДА ТипДенежныхСредств";
	ВыражениеОрганизация = "КОГДА ВычислитьВыражение(1, ""Организация"") = 1 ТОГДА Организация";
	
	УровеньБанкКассы = ГруппировкиОтчета.НайтиПоЗначению("БанкКассы");
	УровеньОрганизация = ГруппировкиОтчета.НайтиПоЗначению("Организация");
	УровеньТипДС = ГруппировкиОтчета.НайтиПоЗначению("ТипДенежныхСредств");
	
	Если УровеньОрганизация = Неопределено Тогда
		ЕстьПорядокБанкОрганизация = Ложь;
		ЕстьПорядокТипДСОрганизация = Ложь;
	Иначе
		ЕстьПорядокБанкОрганизация = (УровеньБанкКассы.Пометка И УровеньОрганизация.Пометка
			И ГруппировкиОтчета.Индекс(УровеньБанкКассы) < ГруппировкиОтчета.Индекс(УровеньОрганизация));
			
		ЕстьПорядокТипДСОрганизация = (УровеньТипДС.Пометка И УровеньОрганизация.Пометка
			И ГруппировкиОтчета.Индекс(УровеньТипДС) < ГруппировкиОтчета.Индекс(УровеньОрганизация));
	КонецЕсли;
	
	Если ЕстьПорядокБанкОрганизация Тогда
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, ВыражениеБанкКассы, "ВыражениеОрганизация");
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, ВыражениеОрганизация, "ВыражениеБанкКассы");
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, "ВыражениеОрганизация", ВыражениеОрганизация);
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, "ВыражениеБанкКассы", ВыражениеБанкКассы);
	КонецЕсли;
	
	Если ЕстьПорядокТипДСОрганизация Тогда
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, ВыражениеТипДС, "ВыражениеОрганизация");
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, ВыражениеОрганизация, "ВыражениеТипДС");
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, "ВыражениеОрганизация", ВыражениеОрганизация);
		РесурсГруппировка.Выражение = СтрЗаменить(РесурсГруппировка.Выражение, "ВыражениеТипДС", ВыражениеТипДС);
	КонецЕсли;
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(ИсточникДоступныхНастроек);
	Компоновщик.ЗагрузитьНастройки(ВариантНастроек);
	
	КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, КомпоновщикОтбор.Настройки.Отбор);
	
	ЗаполнитьПараметрыКомпоновки(Компоновщик.Настройки.ПараметрыДанных);
	
	// Настройка структуры отчета
	
	УровеньВалюта = ГруппировкиОтчета.НайтиПоЗначению("Валюта");
	УровеньОрганизацияЗадан = ?(УровеньОрганизация = Неопределено, Ложь, УровеньОрганизация.Пометка);
	УровеньВалютаЗадан = ?(УровеньВалюта = Неопределено, Ложь, УровеньВалюта.Пометка);

	КорневойЭлементСтруктуры = Компоновщик.Настройки.Структура;
	
	Если Не (УровеньОрганизацияЗадан Или УровеньВалютаЗадан) Тогда
	
		ГруппировкаСКД = ДобавитьСтрокуНеРаспределено(КорневойЭлементСтруктуры,
							Перечисления.ТипыДвиженияДенежныхСредств.Поступление);
		КорневойЭлементСтруктуры.Сдвинуть(ГруппировкаСКД, -1);
		
		ГруппировкаСКД = ДобавитьСтрокуНеРаспределено(КорневойЭлементСтруктуры,
							Перечисления.ТипыДвиженияДенежныхСредств.Списание);
		КорневойЭлементСтруктуры.Сдвинуть(ГруппировкаСКД, -1);
	КонецЕсли;
	
	ГруппировкаСКД = Неопределено;
	Для Каждого Элемент Из ГруппировкиОтчета Цикл
		
		Если Не Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоляГруппировки = ?(Элемент.Значение = "Валюта", "ВалютаОстаток", Элемент.Значение);
		
		Если ГруппировкаСКД = Неопределено Тогда
			ГруппировкаСКД = ФинансоваяОтчетностьСервер.НоваяГруппировка(КорневойЭлементСтруктуры, ИмяПоляГруппировки);
			КорневойЭлементСтруктуры.Сдвинуть(ГруппировкаСКД, -1);
		Иначе
			ГруппировкаСКД = ФинансоваяОтчетностьСервер.НоваяГруппировка(ГруппировкаСКД, ИмяПоляГруппировки);
		КонецЕсли;
		
		Если Элемент.Значение = "БанковскийСчетКасса" Тогда
			ФинансоваяОтчетностьСервер.НовоеПолеГруппировки(ГруппировкаСКД, "ОтдельныйСчетГОЗ");
			ФинансоваяОтчетностьСервер.НовоеПолеГруппировки(ГруппировкаСКД, "ТипДенежныхСредств");
			ФинансоваяОтчетностьСервер.НовыйПорядок(ГруппировкаСКД, "ЗначениеПорядка");
		КонецЕсли;
		
		ФинансоваяОтчетностьСервер.НовоеПолеГруппировки(ГруппировкаСКД, "Валюта");
		ФинансоваяОтчетностьСервер.УстановитьОтбор(ГруппировкаСКД.Отбор, ИмяПоляГруппировки,,
			ВидСравненияКомпоновкиДанных.Заполнено);
		ФинансоваяОтчетностьСервер.НовыйПорядок(ГруппировкаСКД, ИмяПоляГруппировки);
			
		// Параметр "Нулевые остатки и обороты"
		
		ГруппаИли1 = ФинансоваяОтчетностьСервер.НовыйОтбор(ГруппировкаСКД.Отбор, Неопределено,,
			Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИли1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ГруппаИли1.Использование = Истина;
		
		ПараметрНулевыеОстаткиИОбороты = Новый ПолеКомпоновкиДанных("ПараметрыДанных.НулевыеОстаткиИОбороты");
		
		ФинансоваяОтчетностьСервер.УстановитьОтбор(ГруппаИли1, ПараметрНулевыеОстаткиИОбороты, Истина);
		
		ГруппаИ = ФинансоваяОтчетностьСервер.НовыйОтбор(ГруппаИли1, Неопределено,,
			Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаИ.Использование = Истина;
		
		ФинансоваяОтчетностьСервер.УстановитьОтбор(ГруппаИ, ПараметрНулевыеОстаткиИОбороты, Ложь);
		
		ГруппаИли2 = ФинансоваяОтчетностьСервер.НовыйОтбор(ГруппаИ, Неопределено,,
			Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаИли2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		ГруппаИли2.Использование = Истина;
		
		ФинансоваяОтчетностьСервер.УстановитьОтбор(ГруппаИли2, "ОстатокИНеснижаемыйОстаток", 0,
			ВидСравненияКомпоновкиДанных.НеРавно);
		ФинансоваяОтчетностьСервер.УстановитьОтбор(ГруппаИли2, "Оборот", 0, ВидСравненияКомпоновкиДанных.НеРавно);
			
		Если (Элемент.Значение = "Валюта")
			Или (Элемент.Значение = "Организация" И Не УровеньВалютаЗадан) Тогда
			ДобавитьСтрокуНеРаспределено(ГруппировкаСКД, Перечисления.ТипыДвиженияДенежныхСредств.Поступление);
			ДобавитьСтрокуНеРаспределено(ГруппировкаСКД, Перечисления.ТипыДвиженияДенежныхСредств.Списание);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ГруппировкаСКД = Неопределено Тогда
		ГруппировкаСКД = ФинансоваяОтчетностьСервер.НоваяГруппировка(ГруппировкаСКД, "ПоступлениеСписание");
		ФинансоваяОтчетностьСервер.УстановитьОтбор(ГруппировкаСКД.Отбор, "ПоступлениеСписание",,
			ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	МакетСКД = ФинансоваяОтчетностьСервер.ПодготовитьМакетКомпоновкиДляВыгрузкиСКД(СКД, Компоновщик);
	
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСведений.ГрафикПлатежей.РассчитатьГрафикПлатежейПоПоступлениямОтБанкаПоЭквайрингу();
	УстановитьПривилегированныйРежим(Ложь);
	
	ДеревоПлатежей = ФинансоваяОтчетностьСервер.ВыгрузитьРезультатСКДПоМакету(МакетСКД,, Истина);
	
	Для каждого СтрокаДерева Из ДеревоПлатежей.Строки Цикл
		ДенежныеСредстваКлиентСервер.ПересчитатьПодчиненныеСтрокиДерева(СтрокаДерева, ДнейПланирования);
		Обработки.ПлатежныйКалендарь.ПересчитатьДолгосрочныеПериодыВПодчиненныхСтрокахДерева(СтрокаДерева,
			ПериодовДолгосрочногоПланирования, ДнейПланирования);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьКолонкиДней(СКД, Настройки)
	
	ШаблонВыраженияПоля = "
	|ВЫБОР КОГДА ДатаПлатежа = ДобавитьКДате(&ТекущаяДата, ""День"", %1 - 1) ТОГДА
	|	%2
	|ИНАЧЕ 0 КОНЕЦ";
	
	ШаблонВыраженияПоляЕстьОшибка = "
	|ВЫБОР КОГДА ДатаПлатежа = ДобавитьКДате(&ТекущаяДата, ""День"", %1 - 1) ТОГДА
	|	%2
	|ИНАЧЕ ЛОЖЬ КОНЕЦ";
	
	ПоляВыражения = Новый Соответствие;
	ПоляВыражения.Вставить("Оборот", "ВВалюте");
	ПоляВыражения.Вставить("ОборотВОднойВалюте", "ВОднойВалюте");
	
	ПоляВыраженияЕстьОшибка = Новый Массив;
	ПоляВыраженияЕстьОшибка.Добавить("ЕстьОшибкаНеСозданаЗаявка");
	ПоляВыраженияЕстьОшибка.Добавить("ЕстьИсходнаяДатаПлатежаМеньшеПеренесенной");
	ПоляВыраженияЕстьОшибка.Добавить("ЕстьОтличиеВалютПлатежаОтСчетаКассы");
	
	Для Инд = 0 По ДнейПланирования Цикл
		
		ПутьКДанным = "День" + Строка(Инд);
		
		НовыйДень = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД, ПутьКДанным, "1-1", "Сумма");
		ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДень.ПутьКДанным);
		
		Для Каждого Поле Из ПоляВыражения Цикл
		
			ВыражениеПоля = СтрШаблон(ШаблонВыраженияПоля, Инд, Поле.Ключ);
			НовыйДеньСумма = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД, ПутьКДанным + Поле.Значение,
				ВыражениеПоля, "Сумма",
				"ЕСТЬNULL(СУММА(" + ВыражениеПоля + "), 0)");
			ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДеньСумма.ПутьКДанным);
		КонецЦикла;
		
		НовыйДеньОшибкаКритическийОстаток = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД,
			ПутьКДанным + "ОшибкаКритическийОстаток", "ЛОЖЬ");
		ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДеньОшибкаКритическийОстаток.ПутьКДанным);
		
		Для Каждого Поле Из ПоляВыраженияЕстьОшибка Цикл

			ВыражениеПоля = СтрШаблон(ШаблонВыраженияПоляЕстьОшибка, Инд, Поле);
			НовыйДеньЕстьОшибка = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД, ПутьКДанным + Поле,
				ВыражениеПоля,, "МАКСИМУМ(" + ВыражениеПоля + ")");
			ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДеньЕстьОшибка.ПутьКДанным);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьКолонкиДолгосрочногоПланирования(СКД, Настройки)
	
	ШаблонВыраженияПоля = "
	|ВЫБОР
	|	КОГДА ДатаПлатежа = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ""%1""), ""%1"", %2)
	|	ТОГДА %3
	|	ИНАЧЕ 0
	|КОНЕЦ";
	
	ШаблонВыраженияПоляЕстьОшибка = "
	|ВЫБОР
	|	КОГДА ДатаПлатежа = ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ""%1""), ""%1"", %2)
	|	ТОГДА %3
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ";
	
	ПоляВыражения = Новый Соответствие;
	ПоляВыражения.Вставить("Оборот", "ВВалюте");
	ПоляВыражения.Вставить("ОборотВОднойВалюте", "ВОднойВалюте");
	
	ПоляВыраженияЕстьОшибка = Новый Массив;
	ПоляВыраженияЕстьОшибка.Добавить("ЕстьОшибкаНеСозданаЗаявка");
	ПоляВыраженияЕстьОшибка.Добавить("ЕстьИсходнаяДатаПлатежаМеньшеПеренесенной");
	ПоляВыраженияЕстьОшибка.Добавить("ЕстьОтличиеВалютПлатежаОтСчетаКассы");
	
	Для Инд = 1 По ПериодовДолгосрочногоПланирования Цикл
		
		ПутьКДанным = "ДолгосрочныйПериод" + Строка(Инд);
		
		НовыйДолгосрочныйПериод = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД,
			ПутьКДанным,
			"1-1",
			"Сумма");
		ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДолгосрочныйПериод.ПутьКДанным);

		Для Каждого Поле Из ПоляВыражения Цикл
			
			ВыражениеПоля = СтрШаблон(ШаблонВыраженияПоля, Строка(ПериодичностьДолгосрочногоПланирования), Инд, Поле.Ключ);
			НовыйДолгосрочныйПериодСумма = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД,
				ПутьКДанным + Поле.Значение,
				ВыражениеПоля,
				"Сумма",
				"ЕСТЬNULL(СУММА(" + ВыражениеПоля + "), 0)");
			ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДолгосрочныйПериодСумма.ПутьКДанным);
		КонецЦикла;
		
		НовыйДолгосрочныйПериодОшибкаКритическийОстаток = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД,
			ПутьКДанным + "ОшибкаКритическийОстаток", "ЛОЖЬ");
		ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДолгосрочныйПериодОшибкаКритическийОстаток.ПутьКДанным);
		
		Для Каждого Поле Из ПоляВыраженияЕстьОшибка Цикл
		
			ВыражениеПоля = СтрШаблон(ШаблонВыраженияПоляЕстьОшибка, Строка(ПериодичностьДолгосрочногоПланирования), Инд,
				Поле);
			НовыйДеньЕстьОшибка = ФинансоваяОтчетностьСервер.НовыйВычисляемыйРесурс(СКД, ПутьКДанным + Поле,
				ВыражениеПоля,, "МАКСИМУМ(" + ВыражениеПоля + ")");
			ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, НовыйДеньЕстьОшибка.ПутьКДанным);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыКомпоновки(ПараметрыДанных) Экспорт
	
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "ТекущаяДата", ПланироватьСДаты);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "КонечнаяДата", ДатаОкончания);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "ДатаОкончанияПланированияПоДням",
		ДатаОкончанияПланированияПоДням);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "ПериодичностьДолгосрочногоПланирования",
		ПериодичностьДолгосрочногоПланирования);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "НулевыеОстаткиИОбороты", НулевыеОстаткиИОбороты);
	ДатаНачалаОтображенияПросроченныхПлатежей = Обработки.ПлатежныйКалендарь.ДатаНачалаОтображенияПросроченныхПлатежей(
		ПланироватьСДаты, ГлубинаОтображенияПросроченныхПлатежей);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "ДатаНачалаОтображенияПросроченныхПлатежей",
		ДатаНачалаОтображенияПросроченныхПлатежей);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "Кассы", НСтр("ru = 'Кассы'"));
	
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "ВалютаИтогов", ВалютаИтогов);
	
	ОбластиПланирования = ОбластиПланирования();
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "ОбластиПланирования", ОбластиПланирования);
	ФинансоваяОтчетностьСервер.УстановитьПараметр(ПараметрыДанных, "НеОтбиратьПоОбластямПланирования",
		Не ОбластиПланирования.Количество());
	
КонецПроцедуры

Функция ОбластиПланирования() Экспорт
	
	ОбластиПланирования = Новый Массив;
	
	ИспользоватьДоговорыКредитовИДепозитов = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов");
	
	КредитыИлиЗаймыПолученныеВключать = (КредитыИлиЗаймыПолученные И ИспользоватьДоговорыКредитовИДепозитов
		Или Не КредитыИлиЗаймыПолученные И Не ИспользоватьДоговорыКредитовИДепозитов);
	ДепозитыВключать = (Депозиты И ИспользоватьДоговорыКредитовИДепозитов
		Или Не Депозиты И Не ИспользоватьДоговорыКредитовИДепозитов);
	ЗаймыВыданныеВключать = (ЗаймыВыданные И ИспользоватьДоговорыКредитовИДепозитов
		Или Не ЗаймыВыданные И Не ИспользоватьДоговорыКредитовИДепозитов);
	
	ЕстьОтборОбластей = Не (ЗаказыКлиентов И ЗаказыПоставщикам И ВозвратыКлиентам И ВозвратыОтПоставщиков И НесогласованныеЗаявки И ОжидаемыеПоступления
		И КредитыИлиЗаймыПолученныеВключать И ДепозитыВключать И ЗаймыВыданныеВключать);
		
	Если ЕстьОтборОбластей Тогда
		
		ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредств);
		ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.РаспоряженияНаПеремещениеДенежныхСредств);
		ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ДенежныеСредстваВПути);
		
		Если НесогласованныеЗаявки Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ЗаявкиНаРасходованиеДенежныхСредствНесогласованные);
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.РаспоряженияНаПеремещениеДенежныхСредствНесогласованные);
		КонецЕсли;
		
		Если ОжидаемыеПоступления Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ОжидаемыеПоступления);
		КонецЕсли;
		
		Если ЗаказыКлиентов Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.РасчетыСКлиентами);
		КонецЕсли;
		Если ЗаказыПоставщикам Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.РасчетыСПоставщиками);
		КонецЕсли;
		Если ВозвратыКлиентам Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ВозвратыКлиентам);
		КонецЕсли;
		Если ВозвратыОтПоставщиков Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ВозвратыОтПоставщиков);
		КонецЕсли;
		
		Если КредитыИлиЗаймыПолученные Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.КредитыИлиЗаймыПолученные);
		КонецЕсли;
		Если Депозиты Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.Депозиты);
		КонецЕсли;
		Если ЗаймыВыданные Тогда
			ОбластиПланирования.Добавить(Перечисления.ОбластиПланированияПлатежей.ЗаймыВыданные);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбластиПланирования;
	
КонецФункции

Функция ДобавитьСтрокуНеРаспределено(СтруктураКД, ТипДвиженияДенежныхСредств)
	
	Если ТипДвиженияДенежныхСредств = Перечисления.ТипыДвиженияДенежныхСредств.Поступление Тогда
		ИмяПоляГруппировки = "ПоступленияНеРаспределено";
	ИначеЕсли ТипДвиженияДенежныхСредств = Перечисления.ТипыДвиженияДенежныхСредств.Списание Тогда
		ИмяПоляГруппировки = "СписанияНеРаспределено";
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Группировка = ФинансоваяОтчетностьСервер.НоваяГруппировка(СтруктураКД, ИмяПоляГруппировки);
	ФинансоваяОтчетностьСервер.НовоеПолеГруппировки(Группировка, "ПоступлениеСписание");
	ФинансоваяОтчетностьСервер.НовоеПолеГруппировки(Группировка, "Валюта");
	
	ФинансоваяОтчетностьСервер.УстановитьОтбор(Группировка.Отбор, "БанковскийСчетКасса");
	ФинансоваяОтчетностьСервер.УстановитьОтбор(Группировка.Отбор, "ПоступлениеСписание", ТипДвиженияДенежныхСредств);
	ФинансоваяОтчетностьСервер.УстановитьОтбор(Группировка.Отбор, "Валюта",,
		ВидСравненияКомпоновкиДанных.Заполнено);
		
	Возврат Группировка;
	
КонецФункции

#Область НастройкиИОтборы

Процедура УстановитьКомпоновщикОтборПоОтборБанковскиеСчетаКассы(КомпоновщикОтбор, Знач ОтборБанковскиеСчетаКассы)

	БанковскиеСчетаКассы = Новый СписокЗначений;
	Для каждого ЭлементОтбора Из ОтборБанковскиеСчетаКассы Цикл
		Если ЭлементОтбора.Пометка Тогда
			БанковскиеСчетаКассы.Добавить(ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СписокНеПустой = (БанковскиеСчетаКассы.Количество() > 0);
	УстановитьОтборБезПоискаВГруппах(КомпоновщикОтбор.Настройки.Отбор, "БанковскийСчетКасса", БанковскиеСчетаКассы,,
		СписокНеПустой);

КонецПроцедуры

// Устанавливает новый отбор в переданном отборе схемы компоновки данных.
//
// Параметры:
//  ОтборКД - ОтборКомпоновкиДанных - отбор схемы компоновки в который необходимо добавить новый элемент.
//  ЛевоеЗначение - Строка, ПолеКомпоновкиДанных - поле компоновки по которому необходимо установить отбор.
//  ПравоеЗначение  - Произвольный - значение отбора (необязательное).
//  ВидСравнения  - ВидСравненияКомпоновкиДанных - вид сравнение компоновки данных (необязательное).
//  Использование  - Булево - использование нового элемента отбора (необязательное по умолчанию Истина).
//
Процедура УстановитьОтборБезПоискаВГруппах(ОтборКД, ЛевоеЗначение, ПравоеЗначение = Неопределено,
	ВидСравнения = Неопределено, Использование = Истина)
	
	ЭлементОтбора = НайтиЭлементОтбораБезПоискаВГруппахРавноВСписке(ОтборКД, ЛевоеЗначение);
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = ФинансоваяОтчетностьСервер.НовыйОтбор(ОтборКД, ЛевоеЗначение, ПравоеЗначение);
	КонецЕсли;
	ЭлементОтбора.Использование = Использование;
	Если ВидСравнения <> Неопределено Тогда
		ЭлементОтбора.ВидСравнения = ВидСравнения;
	КонецЕсли;
	Если Использование Тогда
		ЭлементОтбора.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ссылку на элемент отбора в переданном отборе схемы компоновки данных.
//
// Параметры:
//  ОтборКД - ОтборКомпоновкиДанных - отбор схемы компоновки в который необходимо добавить новый элемент.
//  ИмяЭлемента - Строка - имя поля компоновки по которому необходимо найти элемент отбора.
//
// Возвращаемое значение:
//   ЭлементОтбораКомпоновкиДанных - ссылка на найденный элемент отбора схемы компоновки данных.
//
Функция НайтиЭлементОтбораБезПоискаВГруппахРавноВСписке(ОтборКД, ИмяЭлемента)
	
	Результат = Неопределено;
	Для Каждого ЭлементОтбора Из ОтборКД.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) <> Тип("ГруппаЭлементовОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяЭлемента) Тогда
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				Или ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
				Результат = ЭлементОтбора;
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
